TASKS = {
    "1_numbers_nine": [
        {"question": """Какое число идёт после 6?""", "answer": "7", "solution": """После 6 идёт число 7
        Ответ: 7"""}
    ],
    
    "1_numbers_ten": [
        {"question": """Какое число идёт перед 10?""", "answer": "9", "solution": """Перед 10 идёт число 9
        Ответ: 9"""}
    ],

    "1_numbers_twenty": [
        {"question": """Сколько единиц в числе 12?""", "answer": "2", "solution": """Число 12 состоит из 1 десятка и 2 единиц
        Ответ: 2"""}
    ],

    "1_length": [
        {"question": """Сколько дм в 10 см""", "answer": "1", "solution": """В 1 дм - 10 см, значит, в 10 см - 1 дм
        Ответ: 1"""}
    ],

    "1_text_tasks": [
        {"question": """Решите задачу: Дима нашёл в лесу 3 белых гриба, а Юля — 2 подберёзовика. Сколько всего грибов нашли дети?""", "answer": "5", "solution": """Дано:
        Дима — 3 гр.
        Юля — 2 гр.
        Всего — ?
        Нужно найти, сколько грибов у детей вместе. Значит, грибов станет больше. Выбираем действие сложение.
        3 + 2 = 5
        Ответ: 5"""}
    ],

    "3_numbers": [
        {"question": """Какая цифра стоит в разряде десятков тысяч?
        935630""", "answer": "3", "solution":"""В разряде десятков тысяч стоит цифра 3
        Ответ: 3"""}
    ],

    "3_sizes": [
        {"question": """Сколько секунд в 1 минуте?""", "answer": "60", "solution":"""1 минута = 60 секунд
        Ответ: 60"""}
    ],

    "3_addition_subtraction": [
        {"question": """Вычислить сумму слагаемых: 4 + 6 + 5""", "answer": "15", "solution":"""4 + 6 + 5 = 15
        Ответ: 15"""}
    ],
    
    "3_multiplication_division": [
        {"question": """Вычислить: 50 * (100 : 5).""", "answer": "1000", "solution":""" 50 * (100 : 5) = (50 * 100) : 5 = 5000 : 5 = 1000
        Ответ: 1000"""}
    ],

    "3_numeric_expression": [
        {"question": """Найдите значение выражения: x + 7, если 𝑥=3""", "answer": "10", "solution":"""Подставлем вместо х 3: 3 + 7 = 10
        Ответ: 10"""}
    ],

    "3_problem_solving": [
        {"question": """Решите задачу. В одну коробку помещается 8 карандашей. Сколько карандашей в 4 таких коробках?""", "answer": "32", "solution":"""Если в одной коробке 8, а коробок 4, нужно повторить число 8 четыре раза.
        Ответ: 32"""}
    ],

    "5_natural_numbers": [
        {"question": """Сколько прямых можно провести через две точки?""", "answer": "1", "solution":"""Через две точки можно провести только 1 прямую
        Ответ: 1"""}
    ],

    "5_initial_geometry": [
        {"question": """Сколько натуральных чисел находится между числами 10 и 15?""", "answer": "4", "solution":"""Между 10 и 15 находятся числа: 11, 12, 13, 14 - 4 числа
        Ответ: 4"""}
    ],

    "5_number_decomposition": [
        {"question": """Найдите наименьшее простое число, на которое делится 72. """, "answer": "2", "solution":"""Наименьшее число, на которое делится 72 - это 2
        Ответ: 2"""}
    ],

    "5_criterion_divisibility": [
        {"question": """Сколько чисел из ряда делятся на 3:
        27, 61, 55, 81, 11, 58, 68, 72""", "answer": "3", "solution":"""27:3 = 9
        81:3 = 27
        72:3 = 24
        Ответ: 3"""}
    ],

    "5_simple_compound": [
        {"question": """Найдите наибольшее двузначное простое число.""", "answer": "97", "solution":"""Возьмём наибольшее двузначное число: 99. Видим, что оно делится, например, на 3, на 9, на 11. То есть у числа больше двух делителей, значит, оно не простое.
        Перед ним в натуральном ряду стоит число 98, которое также не является простым — оно чётное. Значит, берём число ещё раньше: 97.
        Для числа 97 не подобрать других делителей кроме единицы и его самого. Значит, оно простое.
        Ответ: 97"""}
    ],

    "5_common_fractions": [
        {"question": """Найдите результат умножения дробей 7/16 и 8/14""", "answer": "1/4", "solution":"""(7*8)/(16*14)
        Сокращаем 7 и 14, остается 1 и 2: 8/(2*16)
        Сокращаем 8 и 16, остается 1 и 2: 1/(2*2) = 1/4
        Ответ: 1/4"""}
    ],

    "5_mixed_numbers": [
        {"question": """Решите пример: 2⅔ + 5⅛. В ответ запишите числитель полученной смешанной дроби.""", "answer": "19", "solution":"""2⅔ + 5⅛ = (2+5) + (2/3 + 1/8)
        Приводим дробь к общему знаменателю: 7 + (16/24 + 3/24)
        Складываем дроби: 7 + 19/24
        Числитель дроби - 19
        Ответ: 19"""}
    ],

    "7_algebraic_expressions": [
        {"question": """ Найдите значение выражения 9x - 5y при x = 1 и y = 2.""", "answer": "-1", "solution":"""При x = 1 и y = 2 выражение принимает значение
        9x - 5y = 9*1 - 5*2 = -1
        Ответ: -1"""}
    ],

    "7_linear_function": [
        {"question": """ Выпишите вариант ответа, в котором функция y = kx + b возрастает.
        1) y = 15x + 186
        2) y = -15x + 168""", "answer": "1", "solution":"""За возрастание или убывание в линейной функции "отвечает" коэффициент k.
        1) y = 15x + 186, k = 15 > 0, значит, функция возрастает;
        2) y = -15x + 168, k = -15 < 0, значит, функция убывает.
        Ответ: 1"""}
    ],

    "7_simple_equations": [
        {"question": """ Решите систему уравнений с двумя неизвестными. Ответ запишите в виде x;y.
        ⎧2x + y = 7
        ⎨
        ⎩3x - y = 3
        """, "answer": "2;3", "solution":"""⎧2x + y = 7 (1)

        ⎨3x - y = 3 (2)
        ⎩
        1) Из уравнения (1) выразим y: y = 7 - 2x
        2) Подставим в уравнение (2): 3x - (7 - 2x) = 3
        3) Решим: 3x - 7 + 2x = 3 => 5x = 10 => x=2
        4)Найдем y: y = 7 - 2*2 = 7 - 4 = 3
        Ответ: 2;3."""}
    ],

    "7_natural_degree": [
        {"question": """Вычислите значение выражения: 
        3²*((-2)²*6 - 81/3 + 5) - 6²""", "answer": "-18", "solution":"""Сначала вычислим значение выражения в скобках: ((-2)²*6 - 81/3 + 5)
        Согласно порядку действий в выражениях со степенями, сначала возведем (-2) в степень, затем выполним умножение, потом деление, после этого выполним вычитание и сложение:
        (-2)²*6 - 81/3 + 5 = 4*6 - 81/3 + 5 = 24 - 27 + 5 = 2
        Теперь подставим вычисленное значение в исходное выражение вместо скобок. Далее выполним возведение в степень, после этого — умножение и вычитание:
        3²*((-2)²*6 - 81/3 + 5) - 6² = 3²*2 - 6² = 9*2 - 36 = -18
        Ответ: -18"""}
    ],

    "7_monomial": [
        {"question": """Выполните деление одночленов.
        12a⁵b³
        ———
        4a²b²
        Выберите правильный вариант ответа: 
         
        1) 4ab
        2) 3a³b
        3) 3ab³
        4) 3a²b²""", "answer": "2", "solution":"""12a⁵b³⠀⠀12⠀⠀⠀a⁵⠀⠀⠀b³
        ——— = ——×——×——⠀= 3a⁵⁻²b³⁻² = 3a³b
        4a²b²⠀⠀⠀⠀4⠀⠀⠀a²⠀⠀⠀b²
        Правильный ответ под номером 2"""}
    ],

    "7_polynomial": [
        {"question": """Выполните умножение многочленов.
        2a(3ab + a²b³)
        Выберите правильный вариант ответа: 
         
        1) 8a²b³
        2) 6a²b + 2a³b³
        3) 8a³b + 2a²b³
        4) 6a²b + 2a³b²""", "answer": "2", "solution":"""2a(3ab + a²b³) = 6a²b + 2a³b³
        Правильный ответ под номером 2"""}
    ],
    "9_systems_solution": [
        {"question": """ Решите систему уравнений:
        ⎧x₁ + x₂ = −b ÷ a"
         
        ⎨
        ⎩x₁ × x₂ = c ÷ a""", "answer": "6;2", "solution":"""Сначала выразим переменную x из первого уравнения:
        x + 5y = 7
        x = 7 − 5y
        Выражение 7 − 5y подставим вместо переменной x во второе уравнение: 
        3x = 4 + 2y
        3*(7 − 5y) = 4 + 2y 
        Решим второе линейное уравнение в системе:
        3 (7 − 5y) = 4 + 2y
        21 − 15y = 4 + 2y
        21 − 15y − 2y = 4
        21 − 17y = 4
        17y = 21 − 4
        17y = 17
        y = 17 : 17
        y = 1 
        Подставим значение y в первое уравнение и найдем значение x:
        x + 5y = 7
        x + 5 = 7
        x = 7 − 5
        x = 2 """}
    ],
    
        "9_interval_method": [
        {"question": """ Решите неравенство методом интервалов. В ответе напишите только промежуток:
        (x + 2)(x² - 4x + 7)
        ————————— ≥ 0
        ⠀⠀⠀⠀⠀x - 5""", "answer": "-2;5", "solution":"""
        Придём к равносильному неравенству:
        x + 2
        —— < 0
        x - 5
        Решим неравенство методом интервалов. Действуем по алгоритму: числитель левой части равен нулю при x = -2, а знаменатель обращается в ноль при x = 5. Отметим эти точки на координатной прямой. Точки выколоты, потому что неравенство строгое. Эти точки разбивают числовую ось на три интервала. Найдем знаки на каждом из интервалов. На крайнем правом знак положителен, а дальше знаки чередуются.
        ⠀⠀+⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀+
        /////////////⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀/////////
        ______◦__________◦_____>
        ⠀⠀⠀⠀-2////////////////////5⠀⠀⠀⠀x
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀-
        Нам нужен интервал со знаком «минус», то есть такой, где
        x + 2
        —— < 0
        x - 5
        Ответ: x ∈ (-2;5).
        """}
    ],

    "9_function_concept": [
        {"question":"""Функция задана формулой f(x) = 3x - 4
        Найдите значение x, если f(x) = 0. Ответ записать в виде неправильной дроби.""", "answer": "4/3", "solution":"""f(x) = 0
        3x - 4 = 0
        3x = 4
        x = 4/3"""}
    ],

    "9_function_properties": [
        {"question":"""Найдите область значений функции y = x² +2.  В ответ записать только минимальное возможное значение y.""", "answer": "2", "solution":"""x² ≥ 0
        x² + 2 ≥ 2
        y ≥ 2 => y ∈ [2; +∞)
        Минимальное возможное значение y = 2"""}
    ],

    "9_cube_root": [
        {"question":"""Выпишите варианты ответов, в которых oбласть определения D(y): (-∞; +∞).""", "answer": "123", "solution":"""1. Для y = ∛x oбласть определения D(y): (-∞; +∞).
        2. Для y = ∛(x - 2) Подкоренное выражение x - 2  может быть любым, поэтому x - 2 ∈ (-∞; +∞), то есть x ∈ (-∞; +∞).
        3. Для y = ∛(x²-4), x²-4 может быть любым, значит x ∈ (-∞; +∞).
        Для y = 1/(∛x) Здесь подкоренное выражение может быть любым, но само выражение не должно быть равно нулю (знаменатель не ноль), поэтому ∛x ≠ 0 => x ≠ 0. Область определения D(y): (-∞; 0)U(0; +∞).
        Ответ: 123"""}
    ],

    "9_arithmetic_progression": [
        {"question":"""Найдите сумму первых семи членов арифметической прогрессии:
        -3; -1; 1; 3;...""", "answer": "21", "solution":"""a = -3, d = 2, n= 7
        S₇ = 2*(-3) + (7 - 1)*2
        ⠀⠀⠀———————— * 7 = 21
        ⠀⠀⠀⠀⠀⠀⠀⠀2
        Ответ:21"""}
    ],

    "9_geometrical_progression": [
        {"question":"""Найдите сумму первых пяти членов геометрической прогрессии:
        1; 2; 4; 8;...""", "answer": "31", "solution":"""b = 1, q = 2, n= 5
        S₇ = 2⁵ - 1
        ⠀⠀⠀———* 1 = 31
        ⠀⠀⠀⠀2 - 1
        Ответ:31"""}
    ],
    "8_quadratic_equations": [
        {"question":"""Решите квадратное уравнение:
        x² + 2x + 1 = 0""", "answer": "-1", "solution":"""коэффициенты a = 1, b = 2, c = 1, вычислим D = b² - 4ac = 2² - 4 = 4 - 4 = 0, что означает один корень x = -b/2a = -1
        Ответ:-1"""}
    ],
    "8_linear_inequalities": [
        {"question":"""Решите линейное неравенство:
         2x + 1 > 0""", "answer": "(-0,5 ; +∞)", "solution":"""(1) 2x+1>0
         (2) Перенесем постоянную в правую часть и сменим ее знак  2x>-1
         (3) Разделим обе части на 2 x > -0,5
        Ответ:(-0,5 ; +∞)"""}
    ],
    "8_module": [
        {"question":"""Решите пример:
         |-5| + 3 +|4 - 6| = ?""", "answer": "10", "solution":"""5 + 3 + 2 = 10
        Ответ:10"""}
    ],
    "8_square_root": [
        {"question": """Решите пример:
        √9 + √4 = ?""", "answer": "5", "solution": """3 + 2 = 5
    Ответ:5"""}
    ],
    "6_natural_numbers": [
        {"question": """Какое из этих чисел является натуральным?
    -1 2 3,5 0""", "answer": "2", "solution": """-1 отрицательное, 3,5 рационыльное, 0 не относится к натуральным числам 
Ответ:2"""}
    ],
    "6_percent": [
        {"question": """Решите задачу:
    Найдите 30% от 20""", "answer": "6", "solution": """(20 * 3)/10 =6 
Ответ:6"""}
    ],
    "6_rational_numbers": [
        {"question": """Переведите дробь из обыкновенной в периодическую:
    1/3 = ?""", "answer": "0,(3)", "solution": """Поделим 1 на 3 в столбик 
Ответ:0,(3)"""}
    ],
    "6_basics_of_geometry": [
        {"question": """Сколько углов у треугольника?
    """, "answer": "3", "solution": """У треугольника 3 стороны, значит у него 3 угла 
Ответ:3"""}
    ],
    "2_multiplication": [
        {"question": """Решите пример:
    4 * 5 = ?""", "answer": "20", "solution": """4 + 4 + 4 + 4 + 4 = 20
Ответ:20"""}
    ],
    "2_procedure": [
        {"question": """Решите пример:
    4 + 5 * 2 = ?""", "answer": "14", "solution": """4 + 10 = 14
Ответ:14"""}
    ],
    "4_decimal_fractions": [
        {"question": """Решите пример:
    47/100 = ?""", "answer": "0,47", "solution": """47/100 = 0,47
Ответ:0,47"""}
    ],
    "6_transformation_of_literal_expressions": [
        {"question": """Упростите выражение:
    a + 3(a + 2a)""", "answer": "10a", "solution": """a + 3a + 6a = 10a 
Ответ:10a"""}
    ],
    "2_movement_tasks": [
        {"question": """Решите задачу:
    Автомобиль ехал 2 часа со скоростью 90 км/ч. Какое расстояние он проехал?""", "answer": "180", "solution": """S = v * t = 90 * 2 = 180
Ответ:180"""}
    ]

}


