THEMES = {
    1: {"addition": "Сложение",
        "subtraction": "Вычитание", 
        "number_comparison": "Сравнение чисел",
        "greater_than": "Больше",
        "less_than": "Меньше",
        "shapes": "Фигуры"},
    2: ["Умножение", "Деление", "Задачи", "Измерения"],
    3: ["Дроби", "Периметр", "Площадь", "Время"],
    4: ["Десятичные дроби", "Проценты", "Углы", "Графики"],
    5: ["Обыкновенные дроби", "Проценты", "Объем", "Координаты"],
    6: ["Уравнения", "Пропорции", "Окружность", "Статистика"],
    7: ["Алгебра", "Геометрия", "Функции", "Вероятность"],
    8: ["Квадратные уравнения", "Теорема Пифагора", "Тригонометрия", "Стереометрия"],
    9: ["Прогрессии", "Логарифмы", "Векторы", "Производные"]
}